InterviewPreparationReact.tex
% Created 2021-05-22 Sat 21:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abul Kalam Robin}
\date{\today}
\title{Interview Preparation React}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Preparation React},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{React Interview Question}
\label{sec:org0d7e665}
\begin{enumerate}
\item What is React?
\item What are the major features of React?
\item What is JSX?
\item Can web browsers read JSX directly?
\item What are pure components?
\item What is the difference between state and props?
\item What is the purpose of callback function as an argument of setState()?
\item What are synthetic events in React?
\item What is the use of refs? How to use it?
\item What is Virtual DOM? How does it work?
\item What is React Fiber? What is the main goal of it?
\item What are controlled and uncontrolled components?
\item What is Context?
\item What is reconciliation?
\item Is lazy function supports named exports?
\item What are fragments?
\item What are portals in React?
\item What are stateful and stateless components?
\item What are the advantages and disadvantages of React?
\item What is the use of react-dom package?
\item How to use decorators in React?
\item What is CRA and it's benefits?
\item How to enable production mode in React?
\item What is switching component?
\item What is strict mode in React?
\item How to loop inside JSX?
\item What is React Mixins?
\item What are the Pointer Events supported in React?
\item How to listen to state changes?
\item What are hooks?
\item What are the rules needs to follow for hooks?
\item Do you need to rewrite all the class components with hooks?
\item How to fetch data with React Hooks?
\item What is React Scripts?
\item What are the benefits of using typescript with reactjs?
\item What is the purpose of eslint plugin for hooks?
\item What are React Server components?
\end{enumerate}
\end{document}
